name: "resnet50"
platform: "pytorch_libtorch"
max_batch_size: 4
input [
  {
    name: "input__0"
    data_type: TYPE_FP32
    dims: [ 3, 224, 224 ]
  }
]
output [
  {
    name: "output__0"
    data_type: TYPE_FP32
    dims: [ 128]

  }
]
instance_group [
  {
    kind: KIND_CPU
    count: 1
  }
]